# -*- coding: utf-8 -*-
string_list = """

[중고] 혈세록 1-5 (완결)	[중고] 천산혈로 1~7 (완결)	[중고] 대호귀환 (大虎歸還) [작은책] 1~6 (완결) [상태양호]	[중고] 무림지존1-6완	[중고] 무적천마 1-7 완결 .신무협 	[중고] 쌍룡무쌍 1-13 완결 . 신무협 	[중고] 쌍룡기 (雙龍記) 1-11 (완) 세트 => 작은 판형	[중고] 혈사자 1~9 완결. 신무협 	[중고] 개천 1-8 완결 .신무협
[중고] 혈야천록1-3완		[중고] 봉추운 (鳳秋運) 1-7 (완) 세트 => 작은 판형	[중고] 의림천하 1-6 	[중고] [중고] 협마전 1-5 (완결) 	[중고] 화산소장로 1~18	[중고] 무쌍록 1-8 완결. 신무협 	[중고] 천왕. 1-7 완결 .신무협	[중고] 백의무제 1-7 완결 . 신무협 
[중고] 형산마검 1~5 완결		[중고] 광룡전설1-8완	[중고] [중고] 화산진도 1-7 (완결)	[중고] 경공의달인1-5완	[중고] 달이 지다 1-9 완결 . 신무협 	[중고] 의생진검 1-11 완결 .신무협	[중고] 마선행 1-7 완결 . 신무협	[중고] 창귀 1-10 완결 . 신무협 
[중고] 서역유기 1-4 1부완결		[중고] 팔선문 1-9 완결 ☆북앤스토리☆	[중고] 일시참룡 1-5 완결	[중고] 생검사도 1-7 완결. 신무협		[중고] 독왕전기 1-10 완결 . 신무협 	[중고] 단란표국. 1-10 완결. 신무협 	[중고] 천마본기 1-8 완결 .신무협
[중고] 무쌍철협 1-6 완결 ☆북앤스토리☆		[중고] 강호1-6완	[중고] 쾌도난마 1-7				[중고] 단천붕지.1-7 완결. 신무협 	[중고] 청운적하검. 1-7 완결. 신무협 
[중고] 무인지로 1~6 완		[중고] 수라검제 1-9 완결 	[중고] 천군본기 1-7완결					
[중고] 무림정벌기 1-4 완결 ☆북앤북스☆		[중고] 패황강천1-6완	[중고] 천외유천 1-6 완결 /작은책 신무협					
[중고] 무당전설 1-6 완결-북사랑-		[중고] 무적투왕1-5완						
[중고] 호접락어수상 1-3 완결-북유통-		[중고] 세번째삶1-7완						
[중고] 혼비백산 1-4 (완결)		[중고] 흑풍 黑風(1~8완)작은책(신무협) 						
[중고] 비검가1-3완		[중고] 의선사겁 (醫仙四劫) 1-8 (완) 세트						
[중고] 필담무사 1~5 완결		[중고] [중고] 무사곽우 1-6완						
[중고] 음공의 대가 1-7 (완결)		[중고] [중고] 검은매 1~6(완결)						
[중고] 흑도 1-4 완결-북사랑-		[중고] [중고] 만승지존 1-6완						
[중고] 화산군도 1~5 (완결)-북사랑-		[중고] 구중천 (九重天) 1-9 (완) 세트 => 작은 판형						
[중고] 화산독룡1-7완		[중고] 구천마제 1-8 완결						
[중고] [중고] 협마전 1-5 (완결) 		[중고] 일로정진 (一路正進) [작은책] 1~8 (완결) [상태양호]						
[중고] [중고] 강자 (强者) 1-7 (완) 세트 		[중고] 권용찬의 칼 1-7 (완) 세트 => 작은 판형						
[중고] [중고] 반로환동 1-5 완 		[중고] 소천무쌍 (小天無雙) 1-12 (완) 세트 => 작은 판형						
[중고] [중고] 선유신공 仙流神功1-5(완결)		[중고] 속가제자 1-8 완결-북유통-						
[중고] [중고] 괴협 1-4(완결)*		[중고] 풍소천전기1-8완						
[중고] [중고] 흑천1-5(완결)		[중고] 자명1-6완						
[중고] [중고] 청검1-7		[중고] 나곤의만행1-5완						
[중고] [중고] 우뢰검1-6(완) 		[중고] 철혈마룡 1-8완 작은책						
[중고] 한월 1-3 완결 		[중고] 장구로1-5완						
[중고] 이한무장 1-6 완결 -북사랑-		[중고] 청성무사 (靑城武士) 1-8 (완) 세트						
[중고] 노사 1-5 완결		[중고] 경공의 달인1-5완(뿔미디어)(k45)						
[중고] 녹림공자 1-4 작은책		[중고] 병검서생 (病劍書生) 1-8 (완) 세트 => 작은 판형						
[중고] 일월강천 1-6 (완결)		[중고] 단우비 1-8 (완결)						
[중고] 풍류자객 1~5 완		[중고] 포효강호 1-8 완결						
[중고] 풍류자객1-5완		[중고] 역천마제 1-7 완결 /신무협 						
[중고] 난 1-6 완결								
[중고] 천의문 1~8 완								
[중고] 천애고검기 (1~5완) 작은책 								
[중고] 천해문 1-5 완결								
[중고] 천검무적 1~5 완결								
[중고] 청운전기1-6								
[중고] 벼락공자1-5완								
[중고] 상심록 1-3 (완결) 								
[중고] 독문무공 1~8 (완결)								
[중고] 병검무림1-6권(완결)								
[중고] 월백1-7완								
[중고] 십이소 십이다 1-6 (완결) ☆북앤스토리☆								
"""
string_list = string_list.split("[중고]")
list_list = []
result_list = []
for i in string_list:
	a = i.strip("\t").strip()
	list_list.append(a)
for i in list_list:
	if i not in "":
		b = i[:i.find("1")]	
		b = b[:b.find("(")]
		result_list.append(b)
for i in result_list:
	print(i)